Repository: kitconcept/kitconcept.seo
Catalog: src/kitconcept/seo/locales/*/LC_MESSAGES/kitconcept.seo.po
Languages: de, it

source: Description
de: Beschreibung
it: Descrizione

source: Enhances a content type with fields for Search Engine Optimizations
de: Erweitert einen Inhaltstyp um Felder für die Suchmaschinenoptimierung
it: Aggiunge dei campi extra ai content type per il SEO

source: Installs the kitconcept.seo add-on.
de: Installiert das kitconcept.seo Add-on
it: Installa kitconcept.seo

source: Open Graph Description
de: Open Graph Beschreibung
it: Descrizione Open Graph

source: Open Graph Image
de: Open Graph Bild
it: Immagine Open Graph

source: Open Graph Title
de: Open Graph Titel
it: Titolo Open Graph

source: Override the Open Graph description, that Facebook and Twitter use. When empty the default description will be used. Use maximum 155 characters.
de: Überschreibt die Open Graph Beschreibung, die von Facebook und Twitter genutzt wird. Wenn dieses Feld leer ist wird das Standard Beschreibung Feld verwendet. Empfohlene Länge: 155 Zeichen.
it: Sovrascrive la descrizione per Open Graph, utilizzata da Facebook e Twitter. Se vuoto, verrà utilizzata la descrizione del contenuto. Sarebbe indicato utilizzare al massimo 155 caratteri.

source: Override the Open Graph image, that Facebook and Twitter use. When empty the default lead image will be used. Recommended image ratio is 1,91:1 and 1200 x 630px.
de: Überschreibt das Open Graph Bild, welches von Facebook und Twitter genutzt wird. Wenn dieses Feld leer ist wird das Lead Image Feld verwendet.
it: Sovrascrive l'immagine per Open Graph, utilizzata da Facebook e Twitter. Se vuoto, verrà utilizzata l'immagine del contenuto (se presente). La proporzione raccomandata è 1,91:1 e 1200 x 630px.

source: Override the Open Graph title, that Facebook and Twitter use. When empty the default title will be used. Use maximum 60 characters.
de: Überschreibt den Open Graph Titel, der von Facebook und Twitter genutzt wird. Wenn dieses Feld leer ist wird das Standard Titel Feld verwendet. Empfohlene Länge: 60 Zeichen.
it: Sovrascrive il titolo per Open Graph, utilizzato da Facebook e Twitter. Se vuoto, verrà utilizzato il titolo del contenuto. Sarebbe indicato utilizzare al massimo 60 caratteri.

source: Override the meta description. When empty the default description will be used. Use maximum 150 characters.
de: Überschreibt die Meta-Beschreibung.
it: Sovrascrive il meta-tag description. Se vuoto, verrà utilizzata la descrizione del contenuto. Sarebbe indicato utilizzare al massimo 150 caratteri.

source: Override the meta title. When empty the default title will be used. Use maximum 50 characters.
de: Überschreibt den Meta-Titel.
it: Sovrascrive il meta-tag title. Se vuoto, verrà utilizzato il titolo del contenuto. Sarebbe indicato utilizzare al massimo 50 caratteri.

source: Prevents a page from appearing in search engines
de: Schließt die aktuelle Seite vom Suchmaschinen-Index aus.
it: Impedisce alla pagina di essere indicizzata dai motori di ricerca.

source: Tells the search engine to choose this URL as the canonical version and crawl that.
de: Teil der Suchmaschine mit dass die hier hinterlegte URL die kanonische Version ist, die gecrawlt werden soll.
it: Dice ai motori di ricerca di utilizzare l'URL fornito come versione canonica del contenuto corrente, e di conseguenza indicizzano quel contenuto.

source: Title
de: Titel
it: Titolo

source: Uninstalls the kitconcept.seo add-on.
de: Deinstalliert das kitconcept.seo Add-On
it: Disinstalla kitconcept.seo

source: kitconcept.seo (uninstall)
it: kitconcept.seo (disinstalla)
